In [1]:
import numpy as np

In [2]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152') 

row_labels = ['A','B','C','D','E'] 

column_headings = ['Age', 'Height', 'Weight']

In [4]:
import pandas as pd
df1 = pd.DataFrame(data=matrix_data,  

                   index=row_labels, 

                   columns=column_headings) 

print("\nThe DataFrame\n",'-'*25, sep='') 

df1

The DataFrame
-------------------------

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [5]:
print("\nAfter resetting index\n",'-'*35, sep='') 

df1.reset_index()

After resetting index
-----------------------------------

  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [6]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='') 

df1.reset_index(drop=True)

After resetting index with 'drop' option TRUE
---------------------------------------------

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [7]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='') 

df1['Profession'] = "Student Teacher Engineer Doctor Nurse".split() 

df1

Adding a new column 'Profession'
---------------------------------------------

   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [8]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='') 

df1.set_index('Profession')

Setting 'Profession' column as index
---------------------------------------------

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152